package sky.pro.homework.hw1;

public class Task1 {

    public static void main(String[] args) {

// Задача 1
// На уроке мы проходили разные типы переменных.
// Объявите переменные всех типов, что мы изучили на уроке, и присвойте им любые значения (инициализируйте их).

        byte b = 1;
        short s = 2;
        int i = 3;
        long l = 4L;
        float f = 1.1f;
        double d = 1.2;
        char c = '1';
        boolean boo = true;

        System.out.println(" byte: " + b + "\n short: " + s + "\n int: " + i + "\n long:" + l + "\n float: "
                + f + "\n double:" + d + "\n char:" + c + "\n boolean:" + boo);
    }

}
